#ifndef _FLASH_MEMORY_MAP_H_INCLUDED_
#define _FLASH_MEMORY_MAP_H_INCLUDED_
// +----------------------------------------------------------------------------------+
// | Карта расположения данных                                                        |
// +----------+-----------------------+--------+--------------------------------------+
// | Страницы |    Границы памяти     | Размер | Описание назначения                  |
// +----------+-----------------------+--------+--------------------------------------+
// |    00-23 | 0x08000000-0x08005FFF |    24k | Загрузчик устройства                 |
// +----------+-----------------------+--------+--------------------------------------+
// |    24-62 | 0x08006000-0x0800FBFF |    39k | Зарезервировано                      |
// +----------+-----------------------+--------+--------------------------------------+
// |    63-63 | 0x0800FC00-0x0800FFFF |     1k | Энергонезависимая память             |
// +----------+-----------------------+--------+--------------------------------------+

// Границы загрузчика
#define BOOTLOADER_START               0x8000000
#define BOOTLOADER_END                 0x8005FFF
#define BOOTLOADER_SIZE                ((BOOTLOADER_END - BOOTLOADER_START) + 1)

// Границы прошивки
#define FIRMWARE_START                 0x8006000
#define FIRMWARE_END                   0x800FBFF
#define FIRMWARE_SIZE                  ((FIRMWARE_END - FIRMWARE_START) + 1)

// Границы внутреннего хранилища
#define EEPROM_FLASH_START             0x0800FC00
#define EEPROM_FLASH_END               0x0800FFFF
#define EEPROM_FLASH_SIZE              ((EEPROM_FLASH_END - EEPROM_FLASH_START) + 1)

#endif   // _FLASH_MEMORY_MAP_H_INCLUDED_
